sections = [
    {
        'id': 1,
        'section_name': '네이버 정치',
        'base_url': 'news.naver.com/main/main.nhn?mode=LSD&mid=shm&sid1=100'
    },
    {
        'id': 2,
        'section_name': u'네이버 연예',
        'base_url': 'entertain.naver.com'
    }
]

headlines = [
    {
        'id': 1,
        'section_id': 1,
        'title': u'미리 본 선거공보물…文 "든든한 대통령" 安 "새 시대 열린다"(종합)',
        'thumbnail': 'imgnews.naver.net/image/upload/item/2017/04/20/155131817_Untitled-1.jpg?type=nf123_90',
        'cached': True,
        'article_id': 1,
        'article_url': None
        'written_date': '2017-04-20 15:45',
    },
    {
        'id': 2,
        'section_id': 1,
        'title': u'\'대선 TV토론회 네 번 남았다\'…이달 23·25·28일, 5월2일',
        'thumbnail': None,
        'cached': False,
        'article_id': None,
        'article_url': 'news.naver.com/main/read.nhn?mode=LSD&mid=shm&sid1=100&oid=421&aid=0002685710'
    },
    {
        'id': 3,
        'section_id': 2,
        'title': u'[Oh!쎈 톡] ‘효리네민박’, 신청 벌써 5천건 돌파..CP “감사+부담”',
        'thumbnail': None,
        'cached': False,
        'article_id': 2,
        'article_url': None
        'written_date': '2017-04-20 17:51',
    }
]

articles = [
    {
        'id': 1,
        'section_id': 1,
        'author': u'홍정규, 박수윤, 최평천 기자',
        'written_date': '2017-04-20 15:45',
        'textbody': '''\n
洪 "당당한 대통령" 劉 "능력있는 대통령", 沈 "노동이 당당한 나라" 캠프 자금 사정따라 분량도 차이…文·洪·安 16쪽, 劉·沈 8쪽, 趙 4쪽 (서울=연합뉴스) 홍정규 박수윤 최평천 기자 = 각 당 대선후보들이 유권자의 안방에 전달할 선거공보물 제작을 속속 완료하고 있다.  인쇄를 마친 선거공보물이 이번 주말까지 중앙선거관리위원회에 제출되면, 선관위는 오는 25일까지 공보물을 발송한다.  

기호 1번 더불어민주당 문재인 후보는 벽보와 마찬가지로 '나라를 나라답게, 든든한 대통령'을 전면에 배치했다. 이어 광화문 촛불집회 때 사용된 '이게 나라냐!'라는 문구가 새겨진 '촛불 종이컵' 사진을 크게 실었다.  '촛불 민심'을 등에 업고 대권에 도전하는 문 후보의 전략을 단적으로 드러낸 것이다.  그는 "민심이 천심이었다. 나라가 어려울 때마다 나라를 구한 것은 국민이었다"는 글귀를 종이컵 사진에 적어 넣었다.  이어 오른팔을 들어 주먹을 꽉 쥔 모습, 두 팔을 들어 엄지손가락을 세운 모습, 두 손을 펴고 설명하는 모습을 담으면서 자신이 내세우는 '든든한 대통령', '일자리 대통령', 안보 대통령', '광화문 대통령' 등의 구호를 크게 내세웠다.

기호 2번 자유한국당 홍준표 후보 역시 벽보에 실린 대로 '지키겠습니다! 자유대한민국. 당당한 서민 대통령'을 표지로 삼았다.  홍 후보의 공보물을 관통하는 키워드는 '강함'이다. 자신을 가리킨 '스트롱맨' 표현처럼 "강한 대한민국을 만들겠다"는 메시지를 공보물 곳곳에 배치했다.  그는 '무수저 출신'에서 '모래시계 검사'로, 이후 4선 국회의원과 경상남도지사를 지낸 자신이 "가난과, 부패권력과, 기득권과, 좌파와 맞서 이겨냈다"고 강조했다.  그러면서 "대통령 홍준표가 돼 새로운 대한민국을 만들겠다"며 정치, 안보, 행정, 사회, 복지, 경제 등 6개 분야의 대개혁을 다짐했다.

기호 3번 국민의당 안철수 후보는 화제가 됐던 선거 벽보를 공보물 첫 면에 실었다. 당을 상징하는 초록색 바탕에 두 팔을 치켜들고 '국민의당 3 안철수'라는 어깨띠를 두른 모습이다.  가독성을 높이기 위해 역시 초록색 글자로 스토리텔링 방식에 따라 안 후보가 생각하는 시대 정신과 청사진을 제시했다.  "시대가 급변하고 있다. 능력 있는 지도자가 필요하다. 이제 과거가 아닌 미래를 생각하자"며 "근본적 국가 개혁이 필요하다. 새로운 시대가 열린다"는 메시지를 담았다.  일각에서 안 후보의 안보관이 모호하다는 지적이 제기되는 것을 의식한 듯 '튼튼한 안보가 경제의 시작'이라는 구호도 눈에 띈다.

기호 4번 바른정당 유승민 후보는 '능력 있는 대통령'을 강조했다. '당신의 능력을 보여주세요! 보수의 새희망'이라는 문구를 내세우면서 "성공한 대통령이 되겠다. 성공한 정부를 만들겠다"고 다짐했다.  이어 '일하는 사람이 제대로 대접받는 나라', '진실한 대통령, 용감한 대통령', '아이 키우고 싶은 나라' 등을 자신의 지향 가치로 제시했다.  특히 유 후보는 상대적으로 지지율이 낮은 자신을 향한 '사표(死票) 심리'를 의식한 듯 "유승민을 찍으면 유승민이 된다"는 구호를 공보물 마지막 장에 넣었다.

기호 5번 정의당 심상정 후보는 "촛불 시민혁명의 완성은 '노동이 당당한 나라'"라며 "최초의 친노동정부로 국민의 삶을 바꾸겠다"는 약속을 공보물에 담았다.  심 후보는 "촛불이 이룬 탄핵과 대선, 대통령 한 사람 바꾸는 데 머물 수 없다"며 '어떤 정권교체냐가 중요하다'는 메시지를 강조했다.

기호 6번 새누리당 조원진 후보는 '대한민국을 확실히 살릴 대통령'이라는 구호, '대한민국 정체성과 보수우파의 가치를 지켜내겠다'는 다짐과 함께 '곰돌이 캐릭터'를 넣었다.  후보들의 공보물에선 각 당이 처한 자금 사정도 엿보였다.

문 후보, 홍 후보, 안 후보의 공보물은 총 16쪽이다. 유 후보와 심 후보는 절반인 8쪽, 조 후보는 4쪽 분량이다.
''',
        'img_pos': None,
        'img_urls': None,
        'header_text_pos': None,
    },
    {
        'id': 2,
        'section_id': 2,
        'title': u'[Oh!쎈 톡] ‘효리네민박’, 신청 벌써 5천건 돌파..CP “감사+부담”',
        'author': u'강서정 기자',
        'written_date': '2017-04-20 17:51',
        'textbody': '''
[OSEN=강서정 기자] 3년 만에 방송에 복귀하는 가수 이효리의 새 예능 ‘효리네 민박’을 향한 반응이 뜨겁다.  
JTBC 새 예능 ‘효리네 민박’은 이효리가 오랜만에 컴백과 함께 선보이는 프로그램이다. ‘효리네 민박’은 이효리와 남편인 가수 이상순이 출연하는 리얼리티 예능프로그램으로 실제로 제주도에서 거주하고 있는 두 사람이 현지에서 민박집의 호스트 역할을 하며 손님을 맞이한다.  ‘효리네 민박’이 일반인들을 대상으로 하는 만큼 제작진은 오는 5월 첫 촬영을 앞두고 참가 신청을 받고 있다.  
제작진은 오늘(20일) 오전 11시 30분쯤부터 ‘효리네 민박’ 공식 홈페이지를 오픈하고 참가 신청을 받았는데 반나절 만에 벌써 신청 건수가 5천 건을 돌파한 것은 물론 포털사이트 실시간 검색어 1위를 이어가고 있다. 기대 이상의 반응에 제작진도 놀라고 있는 상황.  ‘효리네 민박’의 윤현준 CP는 OSEN에 “이렇게 뜨거운 반응을 예상 못했다. 감사하면서도 부담되기도 한다. 신청자들이 올린 사연을 모두 다 읽어보고 선정 해야겠다”며 “신청을 받는 건 가족, 친구, 연인 등 다양한 관계의 사람들을 만났으면 좋겠고 소통했으면 했기 때문”이라고 했다.  
이어 “‘효리네 민박’에 오는 분들에게는 효리네 부부와 함께 하는 며칠이 좋은 추억이 될 것 같은 마음에 신청하는 것 같다”며 “그런데 민박에 수용할 인원의 한계가 있기 때문에 몇 팀만 선정할 생각이다. 이효리의 집에서 민박을 할지는 고민 중이다”고 했다.
한편 ‘효리네 민박’은 오는 6월 중 방송될 예정이다. /kangsj@osen.co.kr [사진] JTBC 제공
''',
        'img_pos': '0 50',
        'img_urls': 'http://mimgnews1.naver.net/image/109/2017/04/20/0003521871_001_20170420175110583.jpg?type=w540 http://mimgnews1.naver.net/image/108/2017/04/19/0002608208_002_20170419184709290.jpg?type=w540',
        'header_text_pos': None,
    }
]
